note_back/org-mode中tag的使用.org
#+TITLE: Org-mode 中 Tag 的使用指南
#+AUTHOR: Qwen
#+DATE: <2025-12-07 Sun>
#+DESCRIPTION: 掌握 Org-mode 标签系统，高效组织任务与笔记
#+OPTIONS: toc:t


* 简介
在 Org-mode 中，**Tag（标签）** 是附加在大纲条目（headline）上的关键词，用于：
- 分类任务（如 =work=、=home=）
- 标记状态（如 =waiting=、=important=）
- 快速筛选与聚合（通过 agenda 或 sparse tree）

标签具有**继承性**：子条目自动继承父条目的标签（可配置）。

* 基本语法
** 在条目末尾添加标签
标签写在 headline 行末，用冒号包围，多个标签连续排列：

#+begin_example
* 项目计划 :project:work:
* 购物清单 :personal:errands:
* 阅读《原子习惯》 :book:learning:important:
#+end_example

> ✅ 规则：
> - 标签名只能包含字母、数字、下划线和连字符（=a-z0-9_-=）
> - 以冒号开头和结尾，中间无空格
> - 不区分大小写（但建议统一小写）

** 自动补全标签
在编辑 headline 时输入 =:=，Emacs 会弹出已用标签列表供选择（需 =org-complete-tags-always-offer-all-agenda-tags= 为 =t=）。

* 全局标签预定义（推荐）
避免拼写错误，可在配置中预设常用标签：

#+begin_src emacs-lisp
;; 在 ~/.emacs.d/init.el 中
(setq org-tag-alist
      '((:startgroup)
        ("work" . ?w)     ; 按 w 快速插入
        ("home" . ?h)
        ("errands" . ?e)
        ("important" . ?!)
        ("waiting" . ?W)
        (:endgroup)
        ("computer" . ?c)
        ("phone" . ?p)))
#+end_src

效果：
- 按 =C-c C-q= 编辑标签时，可按单字母快速选择（如 =w= → =work=）
- 分组标签（=startgroup/endgroup=）在补全时显示为一组

* 标签继承（Inheritance）
默认情况下，**子条目自动继承父条目的所有标签**。

示例：
#+begin_example
* 工作任务 :work:
** 写报告 :urgent:       → 实际标签：=work:urgent=
** 开会                   → 实际标签：=work=
#+end_example

** 禁用继承
在文件头添加：
#+begin_example
#+TAGS: work(noinherit)
#+end_example
或全局禁用：
#+begin_src emacs-lisp
(setq org-use-tag-inheritance nil)
#+end_src

* 使用标签筛选内容
** 1. Agenda 视图中按标签过滤
- 打开 agenda：=C-c a=
- 按 =m= 进入“匹配标签”视图
- 输入查询，例如：
  - =work= → 所有含 =work= 标签的条目
  - =work|home= → 包含 =work= 或 =home=
  - =work+important= → 同时包含两者
  - =-waiting= → 排除 =waiting=

** 2. 创建稀疏树（Sparse Tree）
在 Org 文件中按 =C-c / m=，输入标签表达式，仅展开匹配的条目。

示例：
- =C-c / m work RET= → 展开所有 =work= 相关任务
- =C-c / m important-waiting RET= → 重要但非等待中的任务

** 3. 搜索标签（Occur）
按 =C-c / o=，输入 =:work:=，列出当前文件所有含 =work= 的 headline。

* 高级技巧
** 1. 标签组（Tag Groups）
使用 =:startgroup= / =:endgroup= 将标签逻辑分组（仅影响补全，不影响功能）：

#+begin_src emacs-lisp
(setq org-tag-alist
      '((:startgroup)
        ("bug" . ?b)
        ("feature" . ?f)
        ("doc" . ?d)
        (:endgroup)
        ("high" . ?1)
        ("medium" . ?2)))
#+end_src

** 2. 动态标签（通过属性）
可通过 =PROPERTIES= 块动态设置标签（较少用）：
#+begin_example
* 任务
:PROPERTIES:
:TAGS: special:temp:
:END:
#+end_example

** 3. 导出时保留标签
默认导出 HTML/PDF 时标签不显示。若需显示，在模板中加入：
#+begin_example
#+OPTIONS: tags:t
#+end_example

** 4. 快速切换/编辑标签
- =C-c C-q= → 编辑当前条目标签（支持补全）
- =C-c C-c= 在 headline 上 → 也可进入标签编辑

* 最佳实践
- ✅ 使用一致命名：=work= 而非 =Work= / =job=
- ✅ 控制标签数量：建议核心标签 ≤ 10 个，避免混乱
- ✅ 结合 TODO 关键字：=TODO 邮件客户 :work:urgent:=
- ✅ 用标签代替复杂分类：比多级目录更灵活

* 常见问题
** Q：标签能嵌套吗
